app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `updated_at`, `text`, `url`) VALUES('2009-12-29 22:02:58', '2009-12-29 22:02:58', 'BBc News', 'http://news.bbc.co.uk/weather/forecast/2174?area=GL53')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save